const questions = [
    {
      id: "q1",
      text: "Что такое JSX в React?",
      options: [
        "Это язык программирования на основе Java",
        "Это расширение синтаксиса JavaScript для описания UI",
        "Это библиотека для управления состоянием",
        "Это инструмент для тестирования компонентов",
      ],
      correctAnswerIndex: 1,
    },
    {
      id: "q2",
      text: "Что такое компонент в React?",
      options: [
        "Функция или класс, который возвращает JSX",
        "HTML-страница",
        "Переменная со стилями",
        "Специальный метод JavaScript",
      ],
      correctAnswerIndex: 0,
    },
    {
      id: "q3",
      text: "Какой хук используется для управления состоянием в функциональных компонентах?",
      options: ["useState", "useEffect", "useContext", "useRef"],
      correctAnswerIndex: 0,
    },
    {
      id: "q4",
      text: "Для чего используется метод .map() в React?",
      options: [
        "Для преобразования массива данных в список JSX-элементов",
        "Для обновления состояния",
        "Для создания нового проекта",
        "Для подключения сторонних библиотек",
      ],
      correctAnswerIndex: 0,
    },
    {
      id: "q5",
      text: "Что должно быть у каждого элемента списка в React?",
      options: ["Класс CSS", "Атрибут id", "Уникальный key", "Название компонента"],
      correctAnswerIndex: 2,
    },
  ]
  
  export default questions
  