const recipes = [
    {
        id: 1,
        name: "Классический омлет",
        ingredients: ["2 яйца", "50 мл. молока", "Соль, перец по вкусу"],
        instructions:
            "Взбейте яйца с молоком и специями. Вылейте на разогретую сковороду и готовьте до золотистого цвета.",
    },
    {
        id: 2,
        name: "Паста с соусом песто",
        ingredients: ["200 г. пасты", "2 ст. ложки соуса песто", "Сыр по вкусу"],
        instructions:
            "Сварите пасту до состояния аль денте (на зубок). Добавьте соус песто и немного сыра, хорошо перемешайте.",
    },
    {
        id: 3,
        name: "Салат Цезарь",
        ingredients: ["Куриное филе", "Салат ромэн", "Соус Цезарь", "Сухарики", "Сыр пармезан"],
        instructions:
            "Нарежьте ингредиенты, смешайте в глубокой миске и заправьте соусом.",
    },
];
  
export default recipes;